// nepalData.ts

export const provinces: string[] = [
  "कोशी",
  "प्रदेश २",
  "बागमती प्रदेश",
  "गण्डकी प्रदेश",
  "लुम्बिनी प्रदेश",
  "कर्णाली प्रदेश",
  "सुदूरपश्चिम प्रदेश",
];

export const districts: Record<string, string[]> = {
  कोशी: [
    "झापा",
    "मोरङ",
    "सप्तरी",
    "सुनसरी",
    "धनकुटा",
    "सङ्खुवासभा",
    "तेरथुम",
    "उदयपुर",
  ],
  "प्रदेश २": [
    "बारा",
    "रौतहट",
    "धनुषा",
    "सर्लाही",
    "सप्तरी",
    "महोत्तरी",
    "सिराहा",
  ],
  "बागमती प्रदेश": [
    "काठमाण्डौ",
    "भक्तपुर",
    "ललितपुर",
    "धादिङ",
    "नुवाकोट",
    "रामेछाप",
    "सिन्धुपाल्चोक",
    "सोलुखुम्बु",
    "काभ्रे",
    "तेह्रथुम",
  ],
  "गण्डकी प्रदेश": [
    "पोखरा",
    "कास्की",
    "गोरखा",
    "स्यान्जा",
    "मनाङ",
    "बागलुङ",
    "नारायणगढ",
  ],
  "लुम्बिनी प्रदेश": [
    "दाङ",
    "बाँके",
    "बर्दिया",
    "नवलपरासी",
    "रुपन्देही",
    "गुल्मी",
    "प्युठान",
  ],
  "कर्णाली प्रदेश": [
    "जुम्ला",
    "डोल्पा",
    "हुम्ला",
    "कालिकोट",
    "सुक्कोट",
    "मुगु",
  ],
  "सुदूरपश्चिम प्रदेश": [
    "कैलाली",
    "कन्चनपुर",
    "डोटी",
    "बझाङ",
    "दार्चुला",
    "बैतडी",
  ],
};
export const municipalities: Record<string, string[]> = {
  उदयपुर: [
    "त्रियुगा नगरपालिका",
    "कटारी नगरपालिका",
    "चौदण्डीगढी नगरपालिका",
    "वेलका नगरपालिका",
    "उदयपुरगढी गाउँपालिका",
    "रौतामाई गाउँपालिका",
    "ताप्ली गाउँपालिका",
    "लिम्चुङबुङ गाउँपालिका",
  ],
  काठमाण्डौ: [
    "काठमाण्डौ महानगरपालिका",
    "नयाँबजार नगरपालिका",
    "कोटेश्वर नगरपालिका",
  ],
  भक्तपुर: ["भक्तपुर नगरपालिका", "सङ्खा नगरपालिका"],
  ललितपुर: ["ललितपुर महानगरपालिका", "महानगर दक्षिण"],
  झापा: ["झापा नगरपालिका १", "झापा नगरपालिका २"],
  मोरङ: ["मोरङ नगरपालिका १", "मोरङ नगरपालिका २"],
  // Add other districts as needed
};
export const wards: string[] = [
  "1",
  "2",
  "3",
  "4",
  "5",
  "6",
  "7",
  "8",
  "9",
  "1०",
];

export const pollingCenters: string[] = [
  "वरपिपल मा.वि., कमलाबारी",
  "मतदान केन्द्र २",
  "मतदान केन्द्र ३",
  "मतदान केन्द्र ४",
  "मतदान केन्द्र ५",
];
